interface IMockCardsProps {
    price: string;
    title: string;
    description: string;
    lists: string[];
}

export const mockCards: IMockCardsProps[] = [
    {
        price: "₴ 5 000/12 занять",
        title: "Telegram Bot (рекомендуємо)",
        description:
            "Короткий опис курсу опис курсу опис курсу опис курсу короткий опис курсу короткий опис курсу",
        lists: [
            "Виконуєте практичні завдання разом з викладачем.",
            "Виконуєте практичні завдання",
            "Виконуєте практичні завдання разом з викладачем.",
            "Виконуєте практичні завдання",
            "Практичні завдання разом з викладачем.",
            "Виконуєте практичні завдання разом з викладачем.",
            "Виконуєте практичні завдання",
        ],
    },
    {
        price: "₴ 8 000/12 занять",
        title: "“Zoom++”",
        description:
            "Короткий опис курсу опис курсу опис курсу опис курсу короткий опис курсу короткий опис курсу",
        lists: [
            "Виконуєте практичні завдання разом з викладачем.",
            "Виконуєте практичні завдання",
            "Виконуєте практичні завдання разом з викладачем.",
            "Виконуєте практичні завдання",
            "Практичні завдання разом з викладачем.",
        ],
    },
];
