interface IMockCardsProps {
  price: string;
  title: string;
  action: string;
  lists: string[];
  subTitle?: string;
  description: string[];
}

export const mockCards: IMockCardsProps[] = [
  {
    price: '5 500 грн',
    action: 'telegramTraining',
    title: 'Курс у Telegram',
    subTitle: '(рекомендуємо)',
    description: ['Проходь повноцінне навчання просто у чат-боті Telegram.'],
    lists: [
      'Проходиш навчання через зручний Telegram-бот',
      'Дивишся відеоуроки в YouTube',
      'Виконуєш практичні завдання та отримуш фідбек',
      'Проходиш тести для закріплення знань',
      'Ставиш запитання викладачу у Telegram',
      'Рухаєшся у власному темпі',
      'Створюєш фінальний проєкт — чат-бот у Telegram',
    ],
  },
  {
    price: '8 500 грн',
    action: 'groupTraining',
    title: 'Групове навчання онлайн',
    description: [
      'Навчання в мінігрупі від 5 осіб із «живими» заняттями в Zoom.',
      'Старт курсу — після формування повної групи. Очікування може тривати кілька місяців.',
    ],
    lists: [
      'Відвідуєш «живі» заняття з викладачем',
      'Переглядаєш відеоуроки у записі',
      'Виконуєш практичні завдання та отримуєш фідбек',
      'Проходиш тести для закріплення знань',
      'Приєднуєшся до Telegram-чату і отримуєш підтримку між заняттями',
      'Створюєш фінальний проєкт — чат-бот у Telegram',
    ],
  },
];
