interface ICardLessProps {
  title: string;
  content: string;
  subContent?: string;
}

export const cardLess: ICardLessProps[] = [
  {
    title: 'Теорія',
    content: 'Вивчаєте теорію через авторські відео-уроки у зручний для вас час.',
  },
  {
    title: 'Практика',
    content: 'Виконуєте домашнє завдання після кожного уроку. Отримуєте фідбек від викладача.',
  },
  {
    title: 'Тести',
    content:
      'Проходите тести для закріплення знань. Це допомагає краще запам’ятати матеріал і впевнено рухатись далі.',
  },
  {
    title: 'Фінальний проект',
    content: 'Створюєте чат-бота в Telegram і отримуєте детальний фідбек від викладача.',
  },
];
