interface ICardLessProps {
    title: string;
    content: string;
    subContent?: string;
}

export const cardLess: ICardLessProps[] = [
    {
        title: "Теорія",
        content:
            "Вивчаєте теорію під час занять з викладачем та через авторські відео-уроки в особистому кабінеті.",
    },
    {
        title: "Практика",
        content:
            "Виконуєте практичні завдання разом з викладачем, обговорюєте складні моменти та готуєтесь до співбесід.",
    },
    {
        title: "Між заняттями",
        content:
            "Виконуєте домашні завдання та отримуєте зворотний зв'язок від викладача.",
        subContent:
            "Спілкуєтеся з одногрупниками в чаті, допомагаючи один одному вирішувати виникаючі питання.",
    },
    {
        title: "Практика",
        content:
            "Створюєте проект для портфоліо та отримуєте детальний фідбек від викладача. ",
        subContent:
            "Оформлюєте резюме та профіль на LinkedIn, готуєтесь до співбесід і працевлаштування!",
    },
];
