interface IAccordionsData {
    title: string;
    text: string[];
}

export const accordionsData: IAccordionsData[] = [
    {
        title: "Вступ. Установка необхідного ПЗ",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "Знайомство з HTML",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "Git. Github",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "Знайомство з CSS",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "Advanced CSS",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "Просунута робота з графікою",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "Семантика і доступність",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
    {
        title: "CSS анімації",
        text: [
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
            "Вступ. Установка необхідного ПЗ",
        ],
    },
];
