import Link from 'next/link';

export default function TermsOfUse() {
  return (
    <div className="pb-6">
      <div className="mb-10 w-full bg-gradient-to-t from-blue-700 via-blue-500 to-blue-300">
        <h1 className="px-2 py-16 text-center text-2xl text-white uppercase lg:py-24 lg:text-5xl">
          Публічний договір (оферта)
        </h1>
      </div>
      <div className="m-auto flex max-w-[950px] flex-col gap-y-4 px-2 md:px-6 lg:px-16 [&>div]:flex [&>div]:flex-col [&>div]:gap-y-2 [&>div>ul]:flex [&>div>ul]:flex-col [&>div>ul]:gap-y-2">
        <p>
          Документ, положення якого викладені нижче по тексту, є публічною офертою та публічним
          договором. Відповідно до ст. ст. 633, 641 Цивільного кодексу України, його умови є
          однаковими для всіх Замовників, а беззастережне прийняття умов якого вважається
          акцептуванням цієї оферти Замовником. У відповідності до ч. 2 ст. 642 Цивільного кодексу
          України, дії визначені в п. 1.4. цього Договору є акцептом цієї оферти, що прирівнюється
          до укладення публічного договору про надання інформаційних послуг (надалі – «Договір») на
          умовах викладених нижче.
        </p>
        <div>
          <h2 className="font-bold">Визначення термінів</h2>
          <ul>
            <li>
              <strong>Матеріали </strong> – лекції, промови, зображення, аудіозаписи, відеоролики,
              презентації та/або інші матеріали, що містять інформаційний характер, які створені
              Виконавцем, або права на які передано Виконавцеві.
            </li>
            <li>
              <strong>Сайт</strong> - вебсторінка, доступна в мережі Інтернет та сторінки в
              соціальних мережах («Facebook», «Instagram» тощо) на яких розміщується інформація щодо
              умов надання Послуг за цим Договором, зокрема, але не виключно вебсайт за посиланням{' '}
              <a className="text-blueBg" href="https://filippacademy.com" target="_blank">
                https://filippacademy.com/
              </a>
            </li>
            <li>
              <strong>Курс</strong> – захід або серія заходів, під час яких Виконавець надає
              Замовнику інформаційні послуги за методиками Виконавця.
            </li>
            <li>
              <strong>Персональні дані</strong> – відомості чи сукупність відомостей про фізичну
              особу, яка ідентифікована або може бути конкретно ідентифікована.
            </li>
            <li>
              <strong>Послуга</strong> – інформаційна послугу з надання доступу до Матеріалів, які
              містять інформаційний характер та які надаються Виконавцем за оплату.
            </li>
            <li>
              <strong>Акцепт</strong> – надання Замовником повної, безумовної та беззастережної
              згоди на укладення цього Договору в повному обсязі, без підпису письмового примірника
              Договору Сторонами.
            </li>
            <li>
              <strong>Платформа</strong> – сайт/сервіс/додаток до якого Замовник отримує доступ за
              допомогою особистих ідентифікаторів доступу (персональне посилання та/або пароль)
              після оплати Послуг Виконавця та у якому розміщуються інформаційні матеріали, які
              надаються Виконавцем, зокрема, але не виключно месенджер Telegram за посиланням
              (https://telegram.org/), платформу Google-диск за посиланням
              (https://drive.google.com/), платформу Google Forms за посиланням
              (https://workspace.google.com/products/forms/), платформу Youtube за посиланням
              (https://www.youtube.com/).
            </li>
            <li>
              <strong>Тариф</strong> – платіж, розмір якого встановлюється Виконавцем за надання
              Послуг за цим Договором для Замовника (вартість Послуг).
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Предмет договору та загальні положення
          </h2>
          <ul>
            <li>
              <strong>1.1. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;На підставі та умовах, визначених
              цим Договором, Виконавець надає Замовнику інформаційні послуги з доступу до
              Матеріалів, а Замовник приймає такі Послуги та сплачує їх за вартістю, вказаною на
              Сайті.
            </li>
            <li>
              <strong>1.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Послуги надаються дистанційно
              через мережу Інтернет, зокрема, шляхом надання доступу до Матеріалів на Платформі.
            </li>
            <li>
              <strong>1.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Договір вважається укладеним і
              вступає в силу з моменту сукупного або окремого виконання Замовником будь-якої з дій,
              передбачених п.
              <strong>1.4.</strong> Договору, що означає повне і беззастережне прийняття ним всіх
              умов Договору без будь-яких виключень та/або обмежень та діє протягом усього терміну
              отримання Послуг, або до моменту розірвання на підставах, визначених умовами Договору
              або нормами чинного законодавства України.
            </li>
            <li>
              <strong>1.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник Послуг здійснює акцепт
              Договору шляхом сукупного або окремого виконання будь-якої з наступних дій:
              <ul className="flex flex-col gap-2 pl-3">
                <li>
                  <strong>1.4.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;оформлення замовлення Послуг на
                  Сайті Виконавця;
                </li>
                <li>
                  <strong>1.4.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;оплата Послуг Виконавця на умовах
                  та в порядку, визначеними цим Договором та на відповідних сторінках Сайту та/або
                  на підставі виставленого рахунку;
                </li>
                <li>
                  <strong>1.4.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;поставив(ла) галочку поруч із
                  тезою: «Я прочитав(ла) і погоджуюсь з умовами Публічного договору (оферти) та
                  Політики конфіденційності»;
                </li>
              </ul>
            </li>

            <li>
              <strong>1.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Всі умови цього Договору є
              обов’язковими як для Замовника, так і для Виконавця. Перед початком користування
              Послугами Замовник зобов’язаний ознайомитися з умовами цього Договору. Якщо Замовник
              не погоджується з умовами цього Договору, він не має права користуватися Послугами
              Виконавця.
            </li>
            <li>
              <strong>1.6.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець повідомляє Замовника,
              що для надання послуги Замовник повинен використовувати програмне забезпечення,
              зокрема, месенджер Telegram за посиланням (https://telegram.org/), платформу
              Google-диск за посиланням (https://drive.google.com/), платформу Google Forms за
              посиланням (https://workspace.google.com/products/forms/), платформу Youtube за
              посиланням (https://www.youtube.com/). Інструкції з інсталяції наявні на вебсайтах
              вказаних в цьому пункті Договору, додаткові інструкції Замовник може отримати від
              Виконавця за письмовим запитом. Замовник підтверджує ознайомлення з цією інформацією
              та погодження з нею.
            </li>
            <li>
              <strong>1.7.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Для отримання Послуг потрібно
              використовувати пристрої, що відповідають вимогам інтероперабельності цифрового
              вмісту. Цифровий вміст функціонуватиме з апаратними засобами чи програмним
              забезпеченням, ідентичним до того, з якими зазвичай використовуються цифровий вміст
              цього типу.
            </li>
            <li>
              <strong>1.8.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;До пристроїв, які підтримують
              цифровий вміст, належать:
              <ul>
                <li>
                  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                  <strong>1.8.1.</strong> телефони та планшети версії Android 5.0 Lollipop або
                  новішої;
                </li>
                <li>
                  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                  <strong>1.8.2.</strong> пристрої iPhone і iPad версії iOS 11 або новішої;
                </li>
                <li>
                  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                  <strong>1.8.3.</strong>
                  комп’ютери, ноутбуки з операційною системою Windows 7, Mac OS X 10.7 чи Ubuntu 10
                  або їх новіші версії та найновішими версіями вебпереглядача Google Chrome, Firefox
                  або Safari.
                </li>
              </ul>
            </li>
            <li>
              <strong>1.9.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Для перегляду цифрового вмісту
              потрібно мати інтернет-з’єднання зі швидкістю не менше ніж 1 Мбіт/с. Щоб цифровий
              вміст завантажувався швидше, закрийте інші вкладки, вебпереглядачі та програми.
            </li>
            <li>
              <strong>1.10.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Вимоги інтероперабельності
              Цифрового вмісту можуть час від часу змінюватися. Щоб дізнатися додаткову інформацію
              про підтримувані пристрої й технічні вимоги, Замовник має надіслати відповідний
              письмовий запит на електронну пошту Виконавця.
            </li>
            <li>
              <strong>1.11.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Послуги й доступний цифровий
              вміст можуть надаватися не в усіх країнах. Замовник погоджується не надавати
              неправдиву, неточну або оманливу інформацію з метою видати себе за резидента іншої
              країни та гарантує, що не намагатиметься обійти обмеження щодо доступу до Послуг.
            </li>
            <li>
              <strong>1.12.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Цифровий контент та цифрова
              послуга надаються у найновішій існуючій версії без подальших оновлень.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Вартість послуг, порядок та умови розрахунків
          </h2>
          <ul>
            <li>
              <strong>2.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник здійснює оплату Послуг за
              Тарифом, який встановлюється Виконавцем та розміщений на Сайті Виконавця. Виконавець
              залишає за собою право змінювати встановлений Тариф для Послуг у разі зміни ринкових
              умов або за інших суттєвих обставин та/або додавати нові Тарифи. Актуальна інформація
              про Тариф для Послуг розміщена на Сайті Виконавця.
            </li>
            <li>
              <strong>2.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; До початку надання Послуг за цим
              Договором Замовник здійснює оплату в розмірі 100% вартості Послуги шляхом
              безготівкового переказу на банківські реквізити, надані Виконавцем Замовнику, або за
              допомогою платіжної системи WayforPay або іншої платіжної системи, визначеної
              Виконавцем.
            </li>
            <li>
              <strong>2.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;У разі не здійснення оплати у
              визначеній сумі, порядку та терміни, Послуги за Договором не надаються, доступ до
              Матеріалів та/або Платформи не надається або анульовується.
            </li>
            <li>
              <strong>2.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Вартість Послуг не включає в себе
              будь-які комісії, що стягуються банками чи платіжними системами за проведення платежу
              та/або за конвертацію валют. Комісійні витрати за здійснення платежів за цим Договором
              Замовник сплачує додатково. Також Замовник несе всі вищевказані витрати у випадку
              повернення Виконавцем йому оплати за послуги Виконавця у випадках, передбачених цим
              Договором.
            </li>
            <li>
              <strong>2.5. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець не несе
              відповідальність за послуги третіх осіб щодо застосуванням платіжних інструментів та
              операторів платіжних систем, та має право відмовити Замовнику у наданні Послуг у
              випадку неотримання оплати від Замовника, якщо оплата була здійснена останнім через
              таких посередників, та кошти не були отримані Виконавцем. Будь-які ризики щодо
              перерахування коштів на рахунок Виконавця несе Замовник до моменту зарахування коштів
              на рахунок Виконавця. Моментом оплати вважається зарахування грошових коштів на
              рахунок Виконавця.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Загальні умови надання послуг
          </h2>
          <ul>
            <li>
              <strong>3.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Моментом завершення надання
              Послуги та виконання обов’язку Виконавця перед Замовником вважається момент надання
              доступу Замовнику до Матеріалів шляхом надсилання їх посиланням на електронну пошту/
              месенджер Telegram (в тому числі в групу з іншими Замовниками) / соціальну мережу
              Instagram/ інший засіб зв’язку Замовника, який був зазначений ним при
              реєстрації/авторизації/оформленні замовлення та/або оплати на Сайті.
            </li>
            <li>
              <strong>3.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Доступ до Курсу надається
              Виконавцем після оплати Замовником Послуг, а надання доступу до Матеріалів курсу
              свідчить про виконання обов’язку Виконавця та споживання Послуг Замовником.
            </li>
            <li>
              <strong>3.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Курс складається із практичних
              завдань, тестів та відео-уроків. Проходження курсу не підтверджується сертифікатом або
              іншим документом.
            </li>
            <li>
              <strong>3.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець відповідає у текстовій
              формі, а в окремих випадках за допомогою голосових повідомлень, на запитання Замовника
              та надає зворотній зв&#x27;язок Замовнику щодо виконаних завдань в межах та у строк
              проходження Курсу. Відповіді та/або зворотній зв&#x27;язок надається протягом 24 годин
              з моменту звернення Замовника. Строк надання відповіді/зворотного зв’язку може бути
              збільшений на розсуд Виконавця.
            </li>
            <li>
              <strong>3.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець може, але не
              зобов’язаний здійснювати перевірку завдань або тестів, що виконуються Замовником у
              межах Курсу. Рішення про надання індивідуального зворотного зв’язку щодо виконаних
              завдань Виконавець приймає на власний розсуд.
            </li>
            <li>
              <strong>3.6.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Курс проходить в одному із таких
              форматів: навчання у чат-боті; групове онлайн-навчання.
            </li>
            <li>
              <strong>3.7.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Навчання у чат-боті відбувається у
              чат-боті месенджера Telegram або іншого месенджера, визначеного Виконавцем.
            </li>
            <li>
              <strong>3.8.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Групове онлайн-навчання
              відбувається за допомогою проведення занять Виконавця із групою, до якої входить
              Замовник, із використання платформи, яка підтримує онлайн-комунікацію. Графік занять
              встановлюється Виконавцем із урахуванням побажань групи. Можливе перенесення часу і
              дати проведення заняття або відміна заняття у зв’язку з особистими причинами Виконавця
              або у зв’язку зі спільним рішенням групи.
            </li>
            <li>
              <strong>3.9.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; У разі невикористання (або
              неможливості використання) Замовником наданих Послуг Виконавця, такі Послуги не
              надаються повторно, не відшкодовуються в грошовому виразі та не
              перепродаються/передаються третім особам, оскільки Послуга вважається наданою з
              моменту, визначеного п. 3.2. Договору.
            </li>
            <li>
              <strong>3.10. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець має право залучати до
              виконання цього Договору третіх осіб, зокрема, укладаючи з ними окремі договори.
              Виконавець має право передавати свої права та обов&#x27;язки за цим Договором третім
              особам без узгодження з Замовником, при цьому Виконавець несе відповідальність перед
              Замовником за дії третіх осіб як за свої власні дії.
            </li>
            <li>
              <strong>3.11.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Факт отримання Послуг Замовником
              підтверджується наданням доступу в порядку, визначеному п. 3.1. Договору без укладення
              Сторонами жодних додаткових документів на підтвердження факту надання Послуг.
              Підписання акту-приймання передачі наданих Послуг не відбувається, Послуга вважається
              прийнятою після отримання Замовником доступу в порядку передбаченому цим пунктом.
            </li>
            <li>
              <strong>3.12.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовнику забороняється видавати
              себе за іншу особу, змінювати біографічні дані, передавати доступ до
              Платформи/Матеріалів іншим особам.
            </li>
            <li>
              <strong>3.13.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Цифровий контент та цифрова
              послуга надається з наступними додатками, приналежностями, застосунками: інформаційні
              Матеріали, зокрема, але не виключно текстові файли, презентації, відео, ілюстрації
              тощо.
            </li>
            <li>
              <strong>3.14.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Виконавець не інформує Замовника
              про необхідність оновлення програмного забезпечення, що підтримує належне
              функціонування цифрового контенту та/або цифрової послуги, включаючи оновлення
              програмного забезпечення, спрямованого на захист даних у цифровій формі і збереження
              відповідності цифрового контенту, що надається, умовам укладеного договору, та не
              забезпечує надання такого оновлення Замовнику. Замовник підтверджує ознайомлення з
              цією інформацією та однозначно погоджується з нею.
            </li>
            <li>
              <strong> 3.15.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник зобов’язаний
              співпрацювати з Виконавцем тією мірою, наскільки це можливо і необхідно для того, щоб
              з’ясувати, що є причиною невідповідності цифрового контенту та/або цифрової послуги на
              момент надання цифрового контенту та/або цифрової послуги, зазначений у частинах
              другій, третій статті 9 Закону України «Про цифровий контент та цифрові послуги»,
              несумісність із цифровим середовищем Замовника.
            </li>
            <li>
              <strong>3.16.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець має право, але не
              зобов&#x27;язаний модифікувати цифровий контент та/або цифрову послугу, в т.ч. у
              випадку необхідності актуалізації матеріалів для покращення цифрового контенту.
              Замовник проводить модифікацію у випадку необхідності актуалізації матеріалів для
              покращення цифрового контенту. Модифікація проводиться без додаткових витрат
              Замовника. Виконавець має право інформувати Замовника про таку модифікацію з допомогою
              надсилання йому Виконавцем відповідного повідомлення на електронну пошту або месенджер
              або в інший спосіб за допомогою інших засобів зв’язку.
            </li>
            <li>
              <strong>3.17.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Якщо Замовник вже здійснив
              оплату за Послуги, але доступ до Матеріалів ще не відбувся у зв’язку з технічними
              збоями роботи Сайту / Платформи, Виконавець протягом 14 банківських днів
              зобов’язується належним чином повторно надати Послугу у випадку, передбаченому цим
              пунктом Договору.
            </li>
            <li>
              <strong>3.18.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Доступ до Матеріалів може бути
              припинено у зв’язку з порушенням умов цього Договору.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">4. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Обмеження</h2>
          <ul>
            <li>
              <strong>4.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець вправі заборонити (або
              обмежити) дії Замовника, що суперечать умовам цього Договору. Такими діями будуть
              вважатися всі перелічені нижче дії, а також ті, які на думку Виконавця порушують умови
              цього Договору.
            </li>
            <li>
              <strong>4.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець забороняє будь-які
              спроби Замовника зібрати інформацію на Платформі або на Сайті.
            </li>
            <li>
              <strong>4.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовникові забороняється
              копіювати або використовувати будь-які частини функціоналу Платформи/Сайту або доступ
              до них у комерційних цілях.
            </li>
            <li>
              <strong>4.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник не має права передавати
              дані доступу до свого облікового запису в сервісі третім особам, а також реєструватися
              від імені іншої людини без її відома або згоди.
            </li>
            <li>
              <strong>4.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Користувачеві не дозволяється
              будь-якими, в тому числі й незаконними, шахрайськими способами, намагатися отримати
              персональну інформацію про інших клієнтів Виконавця.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            5. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Відмова від гарантій
          </h2>
          <ul>
            <li>
              <strong>5.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Послуги Виконавця і всі пов’язані
              матеріали надаються «як є», без будь-яких гарантій, явних чи неявних. Замовник
              погоджується, що використовує Послуги Виконавця виключно на свій розсуд та ризик і
              несе за це односторонню відповідальність.
            </li>
            <li>
              <strong>5.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець не несе ніякої
              відповідальності за можливі не отримані Замовником результати, здобутки,
              працевлаштування, досягнення, прибутки, за репутаційні, інші ризики, тощо, які можуть
              виникнути при використанні Послуг Виконавця. Виконавець не несе відповідальності за
              можливі фінансові або інші втрати Замовника внаслідок застосування отриманих знань,
              оскільки Замовник використовує їх на свій розсуд.
            </li>
            <li>
              <strong>5.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Результати різних Замовників
              можуть значно відрізнятися при користуванні одними і тими ж Послугами. Використовуючи
              Послуги Виконавця, Замовник відмовляється від будь-яких претензій до Виконавця з
              приводу результатів використання Послуг Виконавця, оскільки використовує їх на свій
              розсуд.
            </li>
            <li>
              <strong>5.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник повідомлений про те, що
              його незгода з думкою Виконавця чи залучених ним третіх осіб і змістом Матеріалів не є
              підставою для повернення сплачених грошових коштів.
            </li>
            <li>
              <strong>5.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець не гарантує отримання
              будь-яких кваліфікаційних чи професійних навичок за підсумками навчання. Послуга не є
              освітньою в розумінні ЗУ “Про освіту”.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            6. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Права інтелектуальної власності
          </h2>
          <ul>
            <li>
              <strong>6.1. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Права інтелектуальної власності
              всі об’єкти (в тому числі, проте не виключно, записи уроків, презентації, фото, відео,
              інформаційні та інші матеріали), які надаються в користування Замовнику під час
              надання Послуг за цим Договором з метою належного надання Послуг, належать
              Виконавцеві.
            </li>
            <li>
              <strong>6.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник не має права передавати
              доступ (платно чи безоплатно) до отриманих Матеріалів третім особам, опубліковувати,
              публічно відтворювати будь-яким способом та у будь-якій формі, повторювати, копіювати,
              а також використовувати в комерційних цілях.
            </li>
            <li>
              <strong>6.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник не має та не набуває, в
              процесі користування Послугами Виконавця, майнових та/або немайнових прав
              інтелектуальної власності на об’єкти та продукти інтелектуальної діяльності Виконавця.
            </li>
            <li>
              <strong>6.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник має право використовувати
              обʼєкти інтелектуальної власності Виконавця в особистих та некомерційних цілях, з
              інформаційною метою та без мети отримання прибутку.
            </li>
            <li>
              <strong>6.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник несе повну матеріальну
              відповідальність за використання та/або розповсюдження об’єктів права інтелектуальної
              власності, що належать Виконавцю, всупереч п. 6.4. цього Договору.
            </li>
            <li>
              <strong>6.6.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;У разі виявлення факту плагіату,
              копіювання обʼєктів права інтелектуальної власності Виконавця, їх фрагментів та/або
              несанкціонованого використання, в тому числі, але не виключно запис на відео- або
              аудіо носії, розповсюдження їх у будь-якому форматі, Замовник несе відповідальність
              відповідно до розділу 7 цього Договору.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            7. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Відповідальність сторін та вирішення спорів
          </h2>
          <ul>
            <li>
              <strong>7.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Всі спори та розбіжності, які
              можуть виникнути при виконанні цього Договору, регулюються шляхом переговорів між
              Сторонами. Якщо будь-який спір неможливо вирішити шляхом переговорів, такий спір
              підлягає розгляду в судовому порядку, за місцезнаходженням Виконавця.
            </li>
            <li>
              <strong>7.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець залишає за собою право
              відмовитися від надання Послуг та розірвати Договір в односторонньому порядку в
              будь-який момент без повернення грошових коштів Замовнику, з правом відключення
              Замовника від доступу до всіх Платформ, Сайтів та Матеріалів, доступ до яких надано
              під час надання Послуг за цим Договором, в разі порушення Замовником умов цього
              Договору, зокрема, але не виключно в таких випадках:
              <ul className="flex flex-col gap-2 pl-3">
                <li>
                  <strong>7.2.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;публікація Замовником на будь-яких
                  ресурсах в мережі Інтернет, Сайтах Виконавця, в коментарях та/або в чатах в ході
                  надання Послуг, у пресі, передачу по радіо, телебаченню, з використанням інших
                  засобів масової інформації, в тому числі, соціальних мережах, викладення в
                  характеристиках, заявах, листах, адресованих іншим особам, повідомлення в
                  публічних виступах, а також в іншій формі невизначеному числу осіб або хоча б
                  одній людині, інформації, забороненої цим Договором, недостовірної, неправдивої
                  інформації щодо Виконавця або отриманих Послуг, в тому числі розпалює
                  міжнаціональні конфлікти, містить нецензурні вислови або іншим чином ображає інших
                  Замовників або Виконавця, залучених ним третіх осіб, публікація інформації на
                  Платформах чи Сайтах Виконавця, яка не стосується тематики Послуг або публікація
                  рекламної інформації.
                </li>
                <li>
                  <strong>7.2.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;порушення Замовником дисципліни
                  під час отримання Послуги за цим Договором, а також здійснення наклепів, образ,
                  обмов на Виконавця та/або залучених ним до надання Послуг третіх осіб.
                </li>
                <li>
                  <strong>7.2.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;встановлення факту порушення
                  Замовником прав інтелектуальної власності Виконавця, та/або залучених ним до
                  надання Послуг третіх осіб, інших Замовників.
                </li>
                <li>
                  <strong>7.2.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;неповною оплатою Замовником за
                  надані послуги, згідно з положеннями Договору.
                </li>
                <li>
                  <strong>7.2.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;порушення Замовником своїх
                  обов&#x27;язків, передбачених цим Договором.
                </li>
              </ul>
            </li>
            <li>
              <strong>7.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;У випадку порушень, визначених п.
              7.2. Договору оплата за Послуги, зарахована на поточний рахунок Виконавця, Замовнику
              не повертається, не переноситься на користь третіх осіб і жодним чином не
              компенсується.
            </li>
            <li>
              <strong>7.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;За вчинення Замовником дій з
              порушення прав інтелектуальної власності Виконавця, які визначені в Розділі 6
              Договору, цей Договір розривається, Замовник сплачує штраф Виконавцю у розмірі 40000
              грн, покриває збитки та моральну шкоду.
            </li>
            <li>
              <strong>7.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець не несе
              відповідальності за зміни у роботі та дію інших сервісів і додатків, з допомогою яких
              надається Послуга.
            </li>
            <li>
              <strong>7.6.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Замовник та Виконавець погоджують,
              що норми, передбачені ч. 3 ст. 15 та ст. 16 Закону України «Про цифровий контент та
              цифрові послуги» не застосовуються до правовідносин відповідно до цього Публічного
              договору (оферти). Питання щодо зменшення ціни та повернення сплачених Замовником
              коштів регулюються цим Договором.
            </li>
            <li>
              <strong>7.7.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Цей Договір набуває чинності з
              моменту визначеного в п. 1.4. Договору, вважається укладеним на строк надання послуги
              та/або до повного виконання Сторонами своїх зобов’язань за цим Договором. Договір
              вважається автоматично припиненим (розірваним) у випадках, коли: Замовник в повному
              обсязі скористався Послугами Виконавця, за які була внесена оплата; Замовник не
              скористався послугами Виконавця з власної ініціативи.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            8. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Інші умови договору
          </h2>
          <ul>
            <li>
              <strong>8.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Виконавець має право самостійно
              змінити та/або доповнити умови цього Договору та додатків до нього, включаючи правила
              надання та отримання Послуг за цим Договором. При цьому, Виконавець гарантує та
              підтверджує, що розміщена на Сайті Виконавця поточна редакція тексту цього Договору та
              додатків до нього, включаючи правила надання та отримання Послуг за цим Договором, є
              дійсною.
            </li>
            <li>
              <strong>8.2. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Інформація про Послуги, Цифровий
              вміст, умови їх замовлення, ціни та будь-яка інша інформація, що відображається на
              Сайті є динамічною. Це означає, що інформація може бути оновлена, змінена і доповнена
              Виконавцем в будь-який момент часу без попереднього повідомлення про це Замовника.
              Визначені зміни набирають чинності після їх публікації на Сайті та/або надсилання
              Замовнику в інший спосіб, та застосовуються до будь-якого замовлення, зробленого після
              їх публікації та/або надсилання Замовнику.
            </li>
            <li>
              <strong>8.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Цей Договір розміщено на Сайті та
              востаннє оновлено « 09 травня 2025 року ».
            </li>
          </ul>
        </div>
        <div>
          <h2 className="font-bold">9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Реквізити Виконавця</h2>
          <div>
            <p>ФОП Філіпп Сергій Олександрович </p>
            <p>
              Місцезнаходження: Україна, 49064, Дніпропетровська область, м. Дніпро, вул. Авіаційна,
              буд. 14, кв. 17 РНОКПП: 3447910878
            </p>
            <p>
              Адреса електронної пошти{' '}
              <Link
                href={'mailto:corezoidtraining@gmail.com'}
                className="text-textBlue"
                target="_blank"
                rel="noopener noreferrer"
              >
                corezoidtraining@gmail.com
              </Link>
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
