export default function PrivacyPolicy() {
  return (
    <div className="pb-6">
      <div className="mb-10 w-full bg-gradient-to-t from-blue-700 via-blue-500 to-blue-300">
        <h1 className="px-2 py-16 text-center text-2xl text-white lg:py-24 lg:text-5xl">
          ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ
        </h1>
      </div>
      <div className="flex max-w-[950px] flex-col gap-y-4 px-2 md:px-6 lg:m-auto lg:px-16 [&>div]:flex [&>div]:flex-col [&>div]:gap-y-2 [&>div>ul]:flex [&>div>ul]:flex-col [&>div>ul]:gap-y-2">
        <p>
          Фізична особа — підприємець Філіпп Сергій Олександрович, що діє на підставі запису в
          Єдиному державному реєстру юридичних осіб, фізичних осіб -підприємців та громадських
          громадських формувань (дата запису: 29.11.2021 Номер запису: 2010350000000087702), що
          здійснює надання послуг через Сайт (надалі – «ФОП», «Адміністрація сайту»), розуміючи
          важливість забезпечення конфіденційності й недоторканності Персональних даних фізичних
          осіб, створив цю Політику конфіденційності ( надалі – «Політика») для визначення порядку
          одержання, зберігання, обробки, використання й розкриття Персональних даних Учасника при
          використанні Учасником Послуг.
        </p>
        <p>
          У цій Політиці встановлено порядок здійснення ФОП обробки персональних даних, види
          персональних даних, які збираються, цілі використання таких персональних даних, взаємодія
          ФОП з третіми особами, заходи безпеки для захисту персональних даних, умови доступу до
          персональних даних, а також, контактна інформація для користувача щодо отримання доступу,
          внесення змін, блокування або видалення своїх персональних даних та звернення з будь-якими
          питаннями, які можуть виникнути у Вас щодо практики захисту персональних даних.
        </p>
        <div>
          <h2 className="font-bold">Визначення термінів</h2>
          <ul>
            <li>
              <strong>Персональні дані</strong> – інформація про певного Учасника, яка дозволяє
              ідентифікувати цього Учасника як особистість.
            </li>
            <li>
              <strong>Сайт</strong> - веб-сторінка за посиланням{' '}
              <a className="text-blueBg" href="https://filippacademy.com" target="_blank">
                https://filippacademy.com/
              </a>
              , доступна в мережі Інтернет, на якій розміщується інформація щодо умов надання послуг
              ФОП.
            </li>
            <li>
              <strong>Загальнодоступні дані</strong> – інформація (у тому числі Персональні дані),
              до якої фізична особа - власник цих даних, надала доступ необмеженому колу осіб (у
              т.ч. шляхом публікації на будь-якому інтернет-сайті без обмеження доступу до цих
              даних) або на які відповідно до цієї Політики й/або чинного законодавства України не
              поширюється вимога дотримання конфіденційності.
            </li>
            <li>
              <strong>Послуги</strong> – будь-які пропозиції щодо надання послуг, які розміщені на
              Сайті, які надає ФОП та використовуються Учасниками в порядку та на умовах, визначених
              Договором оферти для таких послуг.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            1. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Загальні положення
          </h2>
          <p>
            <strong>1.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Для користування Сайтом та
            Послугами Учасник зобов&#x27;язаний прийняти умови цієї Політики. Тобто надати свою
            згоду на обробку Персональних даних, Учасник не має права використовувати Сайт та
            послуги, які надаються Сайтом (далі – «Послуги»), у випадку незгоди з умовами цієї
            Політики.
          </p>
        </div>
        <div>
          <h2 className="text-center font-bold">
            2. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Цілі збору і обробки персональних даних
          </h2>
          <ul>
            <li>
              <strong>2.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ця Політика визначає порядок
              одержання, зберігання, обробки, використання й розкриття Персональних,
              Загальнодоступних та інших даних, що надаються ФОП Учасником при використанні ним
              Сайту та Послуг.
            </li>
            <li>
              <strong>2.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Обробка Ваших персональних даних
              відбувається відповідно до вимог Закону України «Про захист персональних даних».
              Обробка персональних даних клієнтів, які перебувають на території ЄС або є громадянами
              ЄС, регулюється також Загальним регламентом про захист даних ЄС 2016/679 (далі -
              «GDPR»).
            </li>
            <li>
              <strong>2.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Обробка Ваших персональних даних
              відбувається &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Використовуючи будь-яку частину Сайту та
              Послуги, Учасник надає ФОП право одержувати, зберігати, обробляти, використовувати й
              розкривати Персональні дані Учасника на умовах цієї Політики.
            </li>
            <li>
              <strong>2.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ця Політика не регулює, а ФОП не
              несе відповідальності, за порядок одержання, зберігання, обробки, використання й
              розкриття Персональних даних Учасника сторонніми підприємствами й організаціями, що не
              перебувають у володінні або під керуванням ФОП, і фізичними особами, що не є
              працівниками ФОП, навіть якщо Учасник отримав доступ до сайтів, програмного
              забезпечення, товарів або послуг цих осіб за допомогою Сайту.
            </li>
            <li>
              <strong>2.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Метою одержання, зберігання,
              обробки й використання Персональних, Загальнодоступних та інших даних Учасника є
              захист інтересів Учасника та Сайту, а також надання Учаснику можливості
              використовувати Сайт, Послуги ФОП, забезпечення ідентифікації Учасника, надання
              Учаснику рекомендацій, рекламної інформації, реєстрація Учасника на вебінари, e-mail
              та/або смс розсилка інформаційних та\або рекламних матеріалів Учаснику.
            </li>
            <li>
              <strong>2.6.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ФОП не перевіряє достовірність
              отриманої інформації (інформації, яка збирається) про користувачів, за виключенням
              випадків, коли така перевірка необхідна в цілях виконання обов’язків перед Учасником.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            3. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Отримання, обробка та використання інформації
          </h2>
          <ul>
            <li>
              <strong>3.1. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; При використанні Сайту для
              отримання Послуг, Учасник вказує ім&#x27;я, прізвище, адресу електронної пошти,
              контактний номер телефону, нікнейм Telegram й інші дані, які він надає добровільно.
            </li>
            <li>
              <strong>3.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ФОП має право зберігати
              Персональні, Загальнодоступні та інші дані Учасника в обсязі та у строки необхідні для
              реалізації мети, що зазначена у цій Політиці, або у строки, встановлені чинним
              законодавством України, нормами міжнародного права, або законодавством країни
              проживання або перебування Учасника, або до моменту видалення Учасником цих даних. ФОП
              зберігає Персональні, Загальнодоступні та інші дані Учасника в хмарних сховищах.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            4. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Доступ до інформації
          </h2>
          <p>
            <strong>4.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp; ФОП зобов&#x27;язується не надавати
            Персональні дані третім особам у комерційних цілях без згоди Учасника, якому належать ці
            дані. Передача Персональних даних третім особам допускається у наступних випадках:
          </p>
          <ul className="pl-3">
            <li>
              <strong>4.1.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp; після одержання згоди Учасника, якому
              належить інформація;
            </li>
            <li>
              <strong>4.1.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;при необхідності передачі Персональних
              даних з метою виконання замовлення або запиту Учасника;
            </li>
            <li>
              <strong>4.1.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;за обґрунтованими запитами державних
              органів, що мають право одержувати такі дані;
            </li>
            <li>
              <strong>4.1.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;у тому випадку, якщо на думку ФОП,
              Учасник порушує умови цієї Політики та/або інших договорів і угод між ФОП та
              Учасником.
            </li>
          </ul>
          <p>
            <strong>4.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Учасник дає згоду, а ФОП має право
            поширювати персональні дані для третіх осіб, які виконують свої зобов’язання щодо
            надання Учаснику послуг, зокрема для Філіпп Кристини Олександрівни. Володільці,
            розпорядники персональних даних та треті особи зобов’язані забезпечити захист цих даних
            від випадкових втрати або знищення, а також від незаконної обробки
          </p>
          <p>
            <strong>4.3. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Учасник погоджується з тим, що
            конфіденційність переданих через Інтернет даних не гарантована і у випадку, якщо доступ
            до цих даних буде отриманий третіми особами поза зоною технічних засобів зв&#x27;язку,
            підвладних ФОП, ФОП не несе відповідальності за збиток, заподіяний таким доступом.
          </p>
          <p>
            <strong>4.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Учасник має право запросити,
            змінити або видалити свої Персональні дані, що знаходяться у доступі ФОП.
          </p>
        </div>
        <div>
          <h2 className="text-center font-bold">
            5. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Захист персональних даних
          </h2>
          <ul>
            <li>
              <strong>5.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ФОП використовує загальноприйняті
              стандарти технологічного та операційного захисту інформації та персональних даних від
              втрати, неправильного використання, зміни або знищення. Однак, не дивлячись на всі
              зусилля, ФОП не може гарантувати абсолютну захищеність від будь-яких загроз, що
              виникають поза межами його регулювання.
            </li>
            <li>
              <strong>5.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ФОП забезпечує застосування всіх
              відповідних зобов&#x27;язань щодо дотримання конфіденційності, а також технічних і
              організаційних заходів безпеки для запобігання несанкціонованого або незаконного
              розголошення або обробки такої інформації та даних, їх випадкової втрати, знищення або
              пошкодження.
            </li>
            <li>
              <strong>5.3.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Поширення персональних даних без
              згоди суб’єкта персональних даних або уповноваженої ним особи дозволяється у випадках,
              визначених законом, і лише (якщо це необхідно) в інтересах національної безпеки,
              економічного добробуту та прав людини.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            6. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Використання файлів cookie
          </h2>
          <p>
            <strong>6.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cookie – це текстовий файл або
            файли, що містять невеликий обсяг інформації, які надсилаються веб-браузеру і
            зберігаються на пристрої користувача. До таких пристроїв можна віднести комп’ютер,
            мобільний телефон або інший пристрій, за допомогою якого Учасник відвідує Сайт.
          </p>
          <p>
            <strong>6.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Файли cookie можуть бути вічними
            (вони називаються постійними файлами cookie) і зберігатися в комп’ютері, поки користувач
            їх не видалить або тимчасовими (такі файли cookie називаються сесійними), тобто
            зберігаються тільки до закриття браузера. Крім того, файли cookie поділяються на основні
            (вони встановлюються безпосередньо відвідуваним Сайтом) і сторонні (встановлюються
            іншими веб-сайтами).
          </p>
        </div>
        <div>
          <h2 className="text-center font-bold">
            7. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Права суб&#x27;єкта персональних даних
          </h2>
          <p>
            <strong>7.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ФОП цим повідомляє та гарантує, що
            Учасник, як суб&#x27;єкт персональних даних, має права, передбачені Законом України «Про
            захист персональних даних», а саме:
          </p>
          <ul className="pl-3">
            <li>
              <strong>7.1.1. </strong> &nbsp;&nbsp;&nbsp;&nbsp;знати про джерела збирання,
              місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження або місце
              проживання (перебування) володільця чи розпорядника персональних даних або дати
              відповідне доручення щодо отримання цієї інформації уповноваженим ним особам, крім
              випадків, встановлених законом;
            </li>
            <li>
              <strong>7.1.2.</strong> &nbsp;&nbsp;&nbsp;&nbsp;отримувати інформацію про умови
              надання доступу до персональних даних, зокрема інформацію про третіх осіб, яким
              передаються його персональні дані;
            </li>
            <li>
              <strong>7.1.3. </strong> &nbsp;&nbsp;&nbsp;&nbsp;на доступ до своїх персональних
              даних;
            </li>
            <li>
              <strong>7.1.4.</strong> &nbsp;&nbsp;&nbsp;&nbsp;отримувати не пізніш як за тридцять
              календарних днів з дня надходження запиту, крім випадків, передбачених законом,
              відповідь про те, чи обробляються його персональні дані, а також отримувати зміст
              таких персональних даних;
            </li>
            <li>
              <strong>7.1.5.</strong> &nbsp;&nbsp;&nbsp;&nbsp;пред’являти вмотивовану вимогу
              володільцю персональних даних із запереченням проти обробки своїх персональних даних;
            </li>
            <li>
              <strong>7.1.6.</strong> &nbsp;&nbsp;&nbsp;&nbsp;пред&#x27;являти вмотивовану вимогу
              щодо зміни або знищення своїх персональних даних будь-яким володільцем та
              розпорядником персональних даних, якщо ці дані обробляються незаконно чи є
              недостовірними;
            </li>
            <li>
              <strong>7.1.7.</strong> &nbsp;&nbsp;&nbsp;&nbsp;на захист своїх персональних даних від
              незаконної обробки та випадкової втрати, знищення, пошкодження у зв&#x27;язку з
              умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від
              надання відомостей, що є недостовірними чи ганьблять честь, гідність та ділову
              репутацію фізичної особи;
            </li>
            <li>
              <strong>7.1.8.</strong> &nbsp;&nbsp;&nbsp;&nbsp;звертатися із скаргами на обробку
              своїх персональних даних до Уповноваженого або до суду;
            </li>
            <li>
              <strong>7.1.9. </strong> &nbsp;&nbsp;&nbsp;&nbsp;застосовувати засоби правового
              захисту в разі порушення законодавства про захист персональних даних;
            </li>
            <li>
              <strong>7.1.10.</strong> &nbsp;&nbsp;&nbsp;вносити застереження стосовно обмеження
              права на обробку своїх персональних даних під час надання згоди;
            </li>
            <li>
              <strong>7.1.11.</strong> &nbsp;&nbsp;&nbsp;відкликати згоду на обробку персональних
              даних;
            </li>
            <li>
              <strong>7.1.12.</strong> &nbsp;&nbsp;&nbsp;знати механізм автоматичної обробки
              персональних даних;
            </li>
            <li>
              <strong>7.1.13.</strong> &nbsp;&nbsp;&nbsp;на захист від автоматизованого рішення, яке
              має для нього правові наслідки.
            </li>
          </ul>
        </div>
        <div>
          <h2 className="text-center font-bold">
            8. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Додаткові умови
          </h2>
          <p>
            <strong>8.1.</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ФОП має право вносити зміни в
            Політику конфіденційності. Усі внесені до Політики зміни будуть доступні у вигляді нової
            редакції Політики. Усі зміни до Політики набувають чинності з моменту їх публікації на
            Сайті. Використовуючи Послуги або Сайт, Учасник підтверджує згоду з новими умовами
            Політики в редакції, що діє на момент використання Учасником Послуг та/або Сайту.
          </p>
          <p>
            <strong>8.2. </strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Дата набрання чинності: 09.05.2025.
          </p>
        </div>
      </div>
    </div>
  );
}
