export interface ISupport {
  title: string;
  text: string[];
  decor: string;
}

export const support: ISupport[] = [
  {
    title: 'Трішки про мене',
    text: [
      'Створюєте проект для портфоліо та отримуєте детальний фідбек від викладача. ',
      'Оформлюєте резюме та профіль на LinkedIn, готуєтесь до співбесід і працевлаштування!',
    ],
    decor: '1',
  },

  {
    title: 'Мій експірієнс',
    text: [
      'Виконуєте домашні завдання та отримуєте зворотний зв`язок від викладача. ',
      'Спілкуєтеся з одногрупниками в чаті, допомагаючи один одному вирішувати виникаючі питання.',
      "Виконуєте домашні завдання та отримуєте зворотний зв'язок від викладача. ",
      'Спілкуєтеся з одногрупниками в чаті, допомагаючи один одному вирішувати виникаючі питання.',
      "Виконуєте домашні завдання та отримуєте зворотний зв'язок від викладача. ",
      'Спілкуєтеся з одногрупниками в чаті, допомагаючи один одному вирішувати виникаючі питання.',
    ],
    decor: '2',
  },
  {
    title: 'Про курс',
    text: [
      'Створюєте проект для портфоліо та отримуєте детальний фідбек від викладача. ',
      'Оформлюєте резюме та профіль на LinkedIn, готуєтесь до співбесід і працевлаштування!',
    ],
    decor: '3',
  },
];
