export interface ISupport {
  title: string;
  text: string[];
  decor: string;
}

export const support: ISupport[] = [
  {
    title: 'Привіт, мене звуть Сергій',
    text: [
      'Я Senior Corezoid Developer. Маю понад 8 років досвіду, навчаю Corezoid з 2020 року.',
      'Менторив розробників у банку та проводив співбесіди, тому знаю, як підготувати тебе до реальної роботи.',
    ],
    decor: '1',
  },

  {
    title: 'Мій досвід',
    text: [
      'Працював у таких компаніях, як: «ПриватБанк», «Банк Восток», Sigma Software.',
      'Маю великий досвід з такими технологіями, як: Corezoid, JavaScript, Simulator Company, SQL, Node-RED. А також досвід у роботі з бізнес-замовниками: аналіз вимог, технічна документація, побудова архітектури процесів.',
      'Створив десятки реальних проєктів — від онлайн-чатів до CRM та голосових ботів.',
      'Розробив авторську навчальну програму з Corezoid, яка вже допомогла багатьом студентам здобути практичні навички та почати кар’єру в ІТ.',
    ],
    decor: '2',
  },
  {
    title: 'Про курс',
    text: [
      'Я створив цей курс, щоб поділитися досвідом та допомогти тобі опанувати перспективну професію Corezoid-роробника з нуля.',
      'Курс вже допоміг багатьом студентам успішно освоїти Corezoid і влаштуватися на роботу в IT.',
    ],
    decor: '3',
  },
];
