export interface ISupport {
  title: string;
  text: string[];
  decor: string;
}

export const support: ISupport[] = [
  {
    title: 'Трішки про мене',
    text: [
      'Я — Senior Corezoid Developer із понад 8 роками досвіду, навчаю Corezoid з 2020 року.  ',
      'Менторив розробників у банку та проводив співбесіди, тому знаю, як підготувати тебе до реальної роботи.',
    ],
    decor: '1',
  },

  {
    title: 'Мій досвід: ',
    text: [
      'Працював у таких компаніях як: ПриватБанк, Банк Восток, Sigma Software.',
      'Маю великий досвід з такими технологіями як: Corezoid, JavaScript, Simulator Company, SQL, Node-RED.',
      'Створив десятки реальних проєктів — від онлайн-чатів до CRM та голосових ботів.',
      'Створив авторську навчальну програму з Corezoid, яка вже допомогла багатьом студентам здобути практичні навички та почати кар’єру в ІТ.',
      'Досвід у роботі з бізнес-замовниками: аналіз вимог, технічна документація, побудова архітектури процесів.',
    ],
    decor: '2',
  },
  {
    title: 'Про курс',
    text: [
      'Я створив цей курс, щоб поділитися досвідом і допомогти тобі опанувати перспективну професію Corezoid роробника з нуля.',
      'Курс вже допоміг багатьом студентам успішно освоїти Corezoid і влаштуватися на роботу розробниками.',
    ],
    decor: '3',
  },
];
